In [1]:
# 7.1 Handling Missing Data

In [2]:
# for data with float64 dtype, pandas uses the floating-point value NaN (Not a Number) to represent misssing data
# this is called  asentienl value; when present, it indicates a missing (or null) value
import pandas as pd
import numpy as np

float_data = pd.Series([1.2,-3.5,np.nan,0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [3]:
# .isna() gives a Boolean Series of result; null = TRUE
float_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
# as alternative to 'NA', a built-in 'None' (case-sensitive) value is also used
string_data = pd.Series(["aardvark",np.nan,None,"avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [5]:
string_data.isna()

0    False
1     True
2     True
3    False
dtype: bool

In [6]:
float_data = pd.Series([1,2,None],dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [7]:
float_data.isna()

0    False
1    False
2     True
dtype: bool

In [8]:
# NA handling object methods
# .dropna() : filter axis labels based on whether values for eahc label have missing data
#          with varying thresholds for how much missing data to tolerate
# .fillna() : fill in missing data with some value or using an interpolation method such as "ffill" or "bfill"
# .isna() : return Boolean values indicating which values are missing/NA
# .notna() : negation of isna, returns True for non-NA values and False for NA values

In [9]:
# Filtering Out Missing Data

In [10]:
# using .dropna() in Series
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [11]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
# another way to filter out missing data in Series
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
# removing missing data in DataFrames - either drop rows or columns that are all NA, or only dropping rows or columns containing any NA
# .dropna() by default drops any row containing a missing value
data = pd.DataFrame([[1,6.5,3.],[1.,np.nan,np.nan],
                     [np.nan,np.nan,np.nan],[np.nan,6.5,3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
data.dropna()
# drops all the rows containing any NA

     0    1    2
0  1.0  6.5  3.0

In [15]:
# passing how = "all" will drop only rows that are all NA
data.dropna(how="all")

# these functions don't modify the original object, just creates a new object

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# to drop columns containing NA, pass the argument axis = "columns"
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis="columns",how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
# only keeping rows contianing at most a certain number of missing observations
# indicate this with the thresh argument
df = pd.DataFrame(np.random.standard_normal((7,3)))
df

          0         1         2
0 -0.409121  1.553850 -1.198146
1 -0.999268 -0.341375 -0.533868
2  1.687975  2.137073  0.963325
3  0.517831  1.962249  0.565518
4  1.264687 -0.363247 -1.078923
5 -1.549182  0.130136 -0.585678
6  0.193706  0.344012  0.109008

In [19]:
df.iloc[:4,1] = np.nan
df.iloc[:2,2] = np.nan
df

          0         1         2
0 -0.409121       NaN       NaN
1 -0.999268       NaN       NaN
2  1.687975       NaN  0.963325
3  0.517831       NaN  0.565518
4  1.264687 -0.363247 -1.078923
5 -1.549182  0.130136 -0.585678
6  0.193706  0.344012  0.109008

In [20]:
df.dropna()

          0         1         2
4  1.264687 -0.363247 -1.078923
5 -1.549182  0.130136 -0.585678
6  0.193706  0.344012  0.109008

In [21]:
# using argument thresh
df.dropna(thresh=2)
# thresh = 2 means non-NaN threshold is 2 (at least 2 non-NaN values), if threshold not met, drop
# thresh = N means the row needs N "votes" to stay in the DataFrame

          0         1         2
2  1.687975       NaN  0.963325
3  0.517831       NaN  0.565518
4  1.264687 -0.363247 -1.078923
5 -1.549182  0.130136 -0.585678
6  0.193706  0.344012  0.109008

In [22]:
# Filling In Missing Data

In [23]:
# .fillna() : filling NaN with a constant
df.fillna(0)

          0         1         2
0 -0.409121  0.000000  0.000000
1 -0.999268  0.000000  0.000000
2  1.687975  0.000000  0.963325
3  0.517831  0.000000  0.565518
4  1.264687 -0.363247 -1.078923
5 -1.549182  0.130136 -0.585678
6  0.193706  0.344012  0.109008

In [24]:
# using fillna() with a dictioinary, can use a different fill value for each column
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.409121  0.500000  0.000000
1 -0.999268  0.500000  0.000000
2  1.687975  0.500000  0.963325
3  0.517831  0.500000  0.565518
4  1.264687 -0.363247 -1.078923
5 -1.549182  0.130136 -0.585678
6  0.193706  0.344012  0.109008

In [25]:
# the same interpolation methods available for reindexing can be used with fillna()
df = pd.DataFrame(np.random.standard_normal((6,3)))
df

          0         1         2
0  1.816645 -0.573687 -0.875961
1 -0.637960  0.106783  1.044568
2  1.044909  1.155794  1.686999
3  0.986802 -0.413790 -0.849823
4 -1.839575 -1.655554  0.396006
5 -0.081789 -2.437511 -0.144841

In [26]:
df.iloc[2:,1] = np.nan
df

          0         1         2
0  1.816645 -0.573687 -0.875961
1 -0.637960  0.106783  1.044568
2  1.044909       NaN  1.686999
3  0.986802       NaN -0.849823
4 -1.839575       NaN  0.396006
5 -0.081789       NaN -0.144841

In [27]:
df.iloc[4:,2] = np.nan
df

          0         1         2
0  1.816645 -0.573687 -0.875961
1 -0.637960  0.106783  1.044568
2  1.044909       NaN  1.686999
3  0.986802       NaN -0.849823
4 -1.839575       NaN       NaN
5 -0.081789       NaN       NaN

In [28]:
df.fillna(method="ffill")
# "ffill" means forward fill; as in Excel "Duplicate Down"
# the NaN values are filled with the preceding non-NaN values, however, ffill stops when it hits a new non-NaN value
# opposite of "ffill" is "bfill" (back fill)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_9556\1120536992.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

          0         1         2
0  1.816645 -0.573687 -0.875961
1 -0.637960  0.106783  1.044568
2  1.044909  0.106783  1.686999
3  0.986802  0.106783 -0.849823
4 -1.839575  0.106783 -0.849823
5 -0.081789  0.106783 -0.849823

In [29]:
df.fillna(method="ffill",limit=2)

# "limit = 2" means limit the fill to 2 rows

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_9556\2927788966.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill",limit=2)

          0         1         2
0  1.816645 -0.573687 -0.875961
1 -0.637960  0.106783  1.044568
2  1.044909  0.106783  1.686999
3  0.986802  0.106783 -0.849823
4 -1.839575       NaN -0.849823
5 -0.081789       NaN -0.849823

In [30]:
# with .fillna() simple data imputation using median or mean statistics is available
data = pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [31]:
data.fillna(data.mean())
# fill the NaN values with .mean()

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [32]:
# .fillna() function arguments
# value : scalar value or dictionary-like object to use to fill missing values
# method : interpolation method - one of "bfill" or "ffill"; default is None
# axis : axis to fill on ("index" or "columns"); default is axis="index"
# limit : for ffill and bfill, maximum number of consecutive periods to fill

In [33]:
# Data Transformation

In [34]:
# Removing Duplicates

In [35]:
# removing duplicate rows
data = pd.DataFrame({"k1":["one","two"]*3 + ["two"],"k2":[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [36]:
# DataFrame .duplicated() method returns a Boolean Series indicating whether each row is a duplicate oe nor
# duplicate means its column values are exactly equal to those in an earlier row
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [37]:
# relatedly, drop_duplicates() returns a DataFrame with rows where the duplicated array is False filtered out
data.drop_duplicates()

# both methods, .duplicated() and .drop_duplicates() by default consider all of the columns;
# alternatively, can specify any subset of them to detect duplicates

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [38]:
# having an additional column of values, and want to filter duplicates based only on the "k1" column
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [39]:
# set column with subset argument
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [40]:
# .duplicated() and .drop_duplicates() by default keep the first observed value combination
# passing keep="last" argument will return the last one
data.drop_duplicates(["k1","k2"],keep="last")

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [41]:
# Transformming Dta Using a Function or Mapping
# transformation based on the values in an array, Series, or column in a DataFrame
data = pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef","bacon","pastrami","honey ham","nova lox"],
                     "ounces":[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [42]:
# suppose we wanted to add a column indicating the type of animal for each food
meat_to_animal = {
    "bacon": "pig",
    "pulled pork": "pig",
    "pastrami": "cow",
    "corned beef": "cow",
    "honey ham": "pig",
    "nova lox": "salmon"
}

meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [43]:
# .map() method on a Series accepts a function or dictionary-like object containing a mapping
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
# could also have passed a function that does all the work
def get_animal(x):
    return meat_to_animal[x]

data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [45]:
# using .map() is a convenient way to perform element-wise transformatioins and other data cleaning-related operations

In [46]:
# Replacing Values
# .map() can be used to modify a subset of values in an object,
# but .replace() provides a simpler and more flexible way
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [47]:
# using "-999" values as sentinel values for missing data - replacing those with NA values
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [48]:
# replacing multiple values at once - passing a list with substitute values
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [49]:
# replacing different values for each, pass a list of substitutes
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [50]:
# passing argument can also be a dictionary
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
# renaming axis indexes
# axis labels can be similarly transformed by a function or mapping of some form to produce new, differently labeled objects
# modifying the axes in place without creating a new data structure
data = pd.DataFrame(np.arange(12).reshape((3,4)),
        index = ["ohio","Colorado","New York"],
        columns = ["one","two","three","four"])
data

          one  two  three  four
ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [52]:
# .map() method for axis indexes, just like in Series
def transform(x):
    return x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [53]:
# can assign to the index attribute, modifying the DataFrame in place
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
# if wanting to create a transformed version without modifying the origina, .renam() can be used
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [55]:
# .rename() can be used in conjuction with a dictionary-like object
data.rename(index={"OHIO":"INDIANA"},
           columns={"three":"peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [56]:
# Discretization and Binning
# data about a group of people in a study, gropuping them into discreet age buckets
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [57]:
# bins = 18 to 25, 26 to 35, 36 to 60, and 61 and older
# use pd.cut()
bins = [18,25,35,60,100]
age_categories = pd.cute(ages,bins)
age_categories

AttributeError: module 'pandas' has no attribute 'cute'

In [ ]:
bins = [18,25,35,60,100]
age_categories = pd.cut(ages,bins)
age_categories
# each bin is identified by a special interval value type containing lower and upper limit of each bin

In [ ]:
# data codified in numberical integers (the "pointer" to the category)
age_categories.codes

In [ ]:
# index of unique labels created; telling what the buckets are called, the "reference table"
age_categories.categories

In [ ]:
age_categories.categories[0]

In [ ]:
# pd.value_counts() are the bin counts for the result of pd.cut()
pd.value_counts(age_categories)

In [ ]:
# in the string representation of an interval, a parenthesis means that the side is open (exclusive)
# square bracket means it's closed (inclusive)
# can change which side is closed by passing "right = False"
pd.cut(ages,bins,right=False)

In [ ]:
# can overrid the default interval-based bin labeling, by passing a list or arroy to the labels
group_names = ["Youth","YoungAdult","MiddleAged","Senior"]
pd.cut(ages,bins,labels=group_names)

In [ ]:
# passing an integer number of bins to pd.cut() instead of explicit bin edges,
# it will compute equal-length bins based on min and max values
data = np.random.uniform(size=20)
data

In [ ]:
pd.cut(data,4,precision=2)

In [ ]:
# pd.qcut() bins the data based on sample quantiles
# it will obtain roughly equally sized bins (slicing in quantiles)
data = np.random.standard_normal(1000)
data

In [ ]:
quartiles = pd.qcut(data,4,precision=2)
quartiles

In [ ]:
pd.value_counts(quartiles)

In [ ]:
# similar to pd.cut(), can pass own quantiles (between 0 and 1, inclusive)
pd.qcut(data,[0,0.1,0.5,0.9,1]).value_counts()

In [ ]:
# Detecting and Filetering Outliers
# filtering and transforming relates applying array operations
data = pd.DataFrame(np.random.standard_normal((1000,4)))
data

In [ ]:
data.describe()

In [ ]:
# filtering values in one of the columns exceeding 3 in absolute value
col = data[2]
col[col.abs() > 3]

In [ ]:
# selecting rows having a value exceeding 3 or -3, can use any method on a Boolean DataFrame
data[(data.abs() > 3).any(axis="columns")]
# .any() asks if there is any TRUE value in the axis (axis="columns" in this case)
# .all() asks if all of the values TRUE

In [ ]:
# capping values outside the interval -3 to 3
data[data.abs() > 3] = np.sign(data)*3
data

# np.sign(data) produces 1 and -1 values based on wheter the values in data are positive or negative

In [ ]:
data.describe()

In [ ]:
# np.sign(data) produces 1 and -1 values based on wheter the values in data are positive or negative
np.sign(data).head()

In [ ]:
# Permutation and Random Sampling
# permuting (randomly reordering) the rows in a DataFrame
# np.random.permuitation() with length of the axis wanting to permute prodcues an array of integers of new ordering
df = pd.DataFrame(np.arange(5*7).reshape((5,7)))
df

In [ ]:
sampler = np.random.permutation(5)
sampler

In [ ]:
# array can then be used in iloc-based indexing or the equivalent .take() function
df.take(sampler)

In [ ]:
df.iloc[sampler]

In [ ]:
# by invoking .take() with axis="columns", can also select a permutation of the columns
column_sampler = np.random.permutation(7)
column_sampler

In [ ]:
df.take(column_sampler,axis="columns")

In [ ]:
# np.random.permutation() is simply generating random array of integers in random order
np.random.permutation(15)

In [ ]:
# to select a random subset without replacement (the same row cannot appear twice)
# can use .sample() on Series and DataFrame
# "n=" seems to be number of rows
df.sample(n=3)

In [ ]:
# to generate sample WITH replacement (to allow repeat choices)
# pass "replace=True" to .sample()
choices = pd.Series([5,7,-1,6,4])
choices.sample(n=10,replace=True)

In [ ]:
# Computing Indicator / Dummy Variables
# common statistical modeling or machine learning application
# converting a categorical variable into a dummy or indicator matrix
# if column in a DataFrame has k distinct values, derive a matrix or DataFrame with k column containing all 1s and 0s
# pd.get_dummires() 
df = pd.DataFrame({"key":["b","b","a","c","a","b"],
                  "data1":range(6)})
df

In [ ]:
pd.get_dummies(df["key"])

In [ ]:
# in some cases, adding a prefix to the columns in the indicator DataFrame could be helpful
# prefix can e merged with the other data
# pd.get_dummies() has a prefix argument
dummies = pd.get_dummies(df["key"],prefix="shit")
dummies

In [ ]:
df_with_dummy = df[["data1"]].join(dummies)
df_with_dummy

In [ ]:
# if row in a DataFrame belongs to multiple categories, use different approach to create dummy varaiables
mnames = ["movie_id","title","genres"]

In [ ]:
movies = pd.read_table("datasets/movielens/movies.dat",sep="::",
                      header=None,names=mnames,engine="python")
movies[:10]

In [ ]:
# pandas has a special Series method str.get_dummies() (methods that start with string)
# multiple group membership encoded as a delimited string
dummies = movies["genres"].str.get_dummies("|")
dummies

In [ ]:
dummies.iloc[:10,:6]

In [ ]:
# as before, can combine this with movies while adding a "Genre_" to the column names in dummies DataFrame
# .add_prefix()
movies_windic = movies.join(dummies.add_prefix("Genre_"))
movies_windic

In [ ]:
# for much larger data, this method is not especially speedy
# it would be better to write a lower-level function that writes directly to a Numpy array
# and wrap the result in a DataFrame

In [ ]:
# a useful recipe for statistical application is to combine pd.get_dummies() with pd.cut()
np.random.seed(12345) # to make the example repeatable
values = np.random.uniform(size=10)
values

In [ ]:
bins = [0,0.2,0.4,0.6,0.8,1]
pd.get_dummies(pd.cut(values,bins))

In [ ]:
# 7.3 Extension Data Types
# Numpy has some disagreeing aspects with Pandas
# such as for NaN, pandas converted the data type to float64 and used np,nan
# this has compounding effects by introducing subtle issues
# datasets with a lot of string data were computationally expensive and use a lot of memory
# recently, pandas has developed an extention type system independent to NumPy
# creating and example Series with missing value
s = pd.Series([1,2,3,None])
s

In [ ]:
s.dtype
# for backward compatibility, Series use legacy behavior of using float64 data type and np.nan for missing value

In [ ]:
# Creating Series wiht pd.Int64Dtype()
s = pd.Series([1,2,3,None],dtype=pd.Int64Dtype())
s

In [ ]:
s.isna()
# NA means value is missing for extension type array

In [ ]:
s[3]

In [ ]:
s[3] is pd.NA

In [ ]:
# we also could have used the shorthand "Int64" instead of pd.Int64Dtype() to specify type
s = pd.Series([1,2,3,None],dtype="Int64")
s

In [ ]:
s = pd.Series(['one','two',None,'three'],dtype=pd.StringDtype())
s

In [ ]:
# string arrayts generally use much less memory and are frequently computationally more efficient on large datasets
# another important extension type is Categorical
# extension types can be passed to the Series .astype() method, in data cleaning process
df = pd.DataFrame({"A":[1,2,None,4],
                  "B":["one","two","three",None],
                  "C":[False,None,False,True]})
df

In [ ]:
df["A"] = df["A"].astype("Int64")
df["B"] = df["B"].astype("string")
df["C"] = df["C"].astype("boolean")
df

In [ ]:
# pandas extension data types
# BooleanDtype : Nullable Boolean data, use 'boolean' when passing as string
# CategoricalDtype : Categorical data type, use 'category' when passing as string
# DatetimeTZDtype : Datetime with time zone
# Float32Dtype : 32-bit nullable floating point, use "Float32" when passing as string
# Float64Dtype : 64-bit nullable floating point, use "Float64" when passing as string
# Int8Dtype : 8-bit nullable signed integer, use "Int8" when passing as string
# Int32Dtype : 32-bit nullable signed integer, use "Int32" when passing as string
# Int64Dtype : 64-bit nullable signed integer, use "Int64" when passing as string
# UInt8Dtype : 8-bit nullable unsigned integer, use "UInt8" when passing as a string
# UInt16Dtype : 16-bit nullable unsigned integer, use "UInt16" when passing as a string
# UInt32Dtype : 32-bit nullable unsigned integer, use "UInt32" when passing as a string
# UInt64Dtype : 64-bit nullable unsigned integer, use "UInt64" when passing as a string

In [ ]:
# 7.4 String Manipulation

In [ ]:
# Python built-in String Object Methods
# comma-separated string can be broken into pieces with .split()
val = "a,b, guido"

In [ ]:
val.split(",")

In [ ]:
# .split() is often combined with strip to trim whitespace (including line breaks)
pieces = [x.strip() for x in val.split(",")]
pieces

In [ ]:
# these substrings could be concatenated together with a two-colon delimiter using addition
first, second, third = pieces
pieces

In [ ]:
first + "::" + second + "::" + third

In [ ]:
# but this isn't a practial generic method; a faster and more Pythonic way is to pass a list or tuple to the .join()
"::".join(pieces)

In [ ]:
# other methods are concerned with locating substrings
# using "in" keyword is the best way to detect a substring, though index and find can also be used
"guido" in val

In [ ]:
val.index(",")

In [ ]:
val.find(":")

In [ ]:
# note that the difference between .find() and .index();
# that index raises an exception if the string isn't found (versus returning -1)
val.index(":")

In [ ]:
# .count() returns the number of occurrences of a praticular substring
val.count(",")

In [ ]:
# .replace will substitute occurrences of one pattern for another
# it is commonly used to delete patterns, too, by passing an empty string
val.replace(",","::")

In [ ]:
val.replace(",","")

In [ ]:
# Python built-in string methods
# .count() : Return the number of nonoverlapping occurrences of substring in the string
# .endswith() : Return True if string ends with suffix
# .startswith() : Return True if string starts with prefix
# .join() : Use string as delimiter for concatenating a sequence of other strings
# .index() : Return starting index of the first occurrence of passed substring if found in string;
#            otherwise, raises ValueError if not found
# .find() : Return position of first character of first occurrence of substring in the string;
#           like index, but returns -1 if not found
# .rfind() : Return postion of first character of last occurrence of substring in the string;
#           returns -1 if not found
# .replace() : Replace occurrences of string with another string
# .strip(), .rstrip(), .lstrip() :
# Trim whitespace, including newlines on both sides, on the right side, or on the left side
# .split() : Break string into list of substrings using passed delimiter
# .lower() : Convert alphabet characters to lowercase
# .upper() : Convert alphabet characters to uppercase
# .casefold() : Convert characters to lowercase, and convert any region-specific varable character combinations to a common comparable form
# .ljust(), .rjust() : Left justify or right justify, respectively;
#                     pad opposite side of string with spaces (or some other fill character) to return a string with a minimum width

In [ ]:
# Regular Expressions
# regular expressions provide a felxible way to search or match string patterns in text
# a single expression, commonly called regex, is a string formed according to the regular expression language

# re module functions fall into three categories:
# pattern matching, substitution, and splitting
# splitting a variable number of whitespace characters - tabs, spaces, and newlines
# the regex describing one or more whitespace characters is \s+:

import re
text = "foo  bar\tbaz \tqux"
text

In [ ]:
re.split(r"\s+",text)

In [ ]:
# always use r for regex pattern; r stands for "Raw"
# \s means "any whitespace"; + means "one or more"
# and import re! so, re.split(r"\s+", text) is like Excel's TRIM()

In [ ]:
# when calling re.split(r"\s+", text), the regex is first compiled, and then its .split() is called on the passed text
# can compile the regex yourself with re.compile(); this forms a reusable regex object
regex = re.compile(r"\s+")

In [ ]:
regex

In [ ]:
regex.split(text)

In [ ]:
# instead, if wanted to get a list of all patterns matching the regex, can use .findall()
regex.findall(text)

In [ ]:
# creating a regex object with re.compile() is highly recommended, for saving CPU cycles

In [ ]:
# match and search are closly related to .findall()
# while .findall() returns all matches in a string, .search() returnls only the first match
# .match() only matches at the beginning of the string
# email addresses as example
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# [A-Z0-9._%+-] : Find those patterns, any character in that is allowed
# + : "one or more"
# @ : find "@"
# [A-Z0-9.-] : A-Z, 0-9, ., - are allowed
# + = "one or more"; \. : find "."
# [A-Z]{2,4} : find A-Z but between 2 and 4 charecters long (e.g. .com, .de, .info)

regex = re.compile(pattern,flags=re.IGNORECASE)
# compile (contain) from the object "pattern" into object "regex", ignore cases

In [ ]:
# using .findall()
regex.findall(text)

In [ ]:
# .search() returns a special match object for the first email address in the text
# .match() object can only tell us the start and end position of the pattern in the string
m = regex.search(text)
m

In [ ]:
text[m.start():m.end()]

In [ ]:
# regex.match returns None, as it will match only if the pattern occurs at the start of the string
print(regex.match(text))

In [ ]:
# .sub() will return a new string with occurrences of the pattern replaced by a new string
print(regex.sub("REDACTED",text))

# .sub() functions like Excel's "Find and replace"

In [ ]:
# suppose you want to segment each addres into 3 components - user name, domain name, and domain suffix
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern,flags=re.IGNORECASE)

In [ ]:
# returning a tuple of pattern components with .groups() method
m = regex.match("wesm@bright.net")
m.groups()

In [ ]:
# findall() returns a list of tuples when pattern has groups
regex.findall(text)

In [ ]:
# .sub() also has access to .groups() in each .match() using special symbols; \1 \2
# \1 corresponds to the first matched group, \2 corresponds to the second, and so forth
print(regex.sub(r"Username:\1,Domain:\2,Suffix:\3",text))

In [ ]:
# more regular expressions
# .findall() : Return all noneoverlapping matching patterns in a string as a list
# .finditer : Like .findall() but returns an iterator
# .match() : Match pattern at start of the string and optionally segment pattern components into groups;
#            if the pattern matches, return a match object, and otherwise None
# .search() : Scan string for match to pattern, returning a match object if so;
#             unlike .match(), the match can be anywhere in the string
# .split() : Break string into pieces at each occurrence of pattern
# .sub(), .subn() : Replace all (sub) or first n occurrences (subn) of pattern in string with replacement expression;
#                   use symbols \1, \2, ... to refer to match group elements in the replacement string

In [68]:
# String Functions in pandas
# cleaning up messy string data; dealing with missing data
data = {"Dave":"dave@google.com","Steve":"steve@gmail.com",
       "Rob":"rob@gmail.com","Wes":np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [69]:
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [70]:
# string and regex expression methods can be applied (passing lambda or other function) to each using data.map()
# but will fail on NA values
# So, Series has array-oriented methods for string operations that skip over and propagate NA values
# accessed through Series' str attribute - can check whether each email address has "gmail" in it with .str.contains()
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [71]:
# dtype above is object; pandas has extention types that provide for specialized treatment of strings, integers and boolean data
data_as_string_ext = data.astype('string')
data_as_string_ext

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                 <NA>
dtype: string

In [72]:
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [73]:
# regex can also be used, along with any re options like IGNORECASE
import re
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"

In [75]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [80]:
# there are a couple ways to do vectorized elemnet retrieval
# either use str.get() or index into the str attribute
matches = data.str.findall(pattern,flags=re.IGNORECASE).str[0]
matches

Dave     (dave, google, com)
Steve    (steve, gmail, com)
Rob        (rob, gmail, com)
Wes                      NaN
dtype: object

In [82]:
# .str prefix : commanding to go inside every cell and treat the contents as string
# data.str.findall() --> present all of them as they are, which is in boxes (lists)
# data.str.findall().str[0] --> present only the 1st in the boxes, picking them out of the box

In [87]:
# getting index [1] from the result
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [88]:
# can slice strings using the syntax
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [89]:
# .str.extract() will return the captured groups of a regex as a DataFrame
data.str.extract(pattern,
                 flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [91]:
# Partial listing of Series string methods
# .cat() : Concatenate strings element-wise with optional delimiter
# .contains() : Return Boolean array if each string contains pattern/regex
# .count() : Count occurrences of pattern
# .extract() : Use a regex with groups to extract one or more strings from a Series of strings;
#              the results will be a DataFrame with one column per group
# .endswith() : Equivalent to x.endswith(pattern) for each element
# .startswith() : Equivalent to x.startswith(pattern) for each element
# .findall() : Compute list of all occurrences of pattern/regex for each string
# .get() : Index into each element (retrieve i-th element)
# .isalnum() : Equivalent to built-in .str.alnum()
# .isalpha() : Equivalent to built-in .str.isalpha()
# .isdecimal() : Equivalent to built-in .str.isdecimal()
# .isdigit() : Equivalent to built-in .str.isdigit()
# .islower() : Equivalent to built-in .str.islower()
# .isnumeric() : Equivalent to built-in .str.isnumeric()
# .isupper() : Equivalent to built-in .str.isupper()
# .join() : Join strings in each element of the Series with passed separator
# .len() : Compute length of each string
# .lower(), .upper() : Covert cases; equivalent to x.lower() or x.upper() for each element
# .match() : Use re.match() with the passed regex on each element, returning True or False whether it matches
# .pad() : Add whitespace to left, right, or both sides of strings
# .center() : Equivalent to .pad(side="both")
# .repeat() : Duplicate values (e.g. s.str.repeat(3) is equivalent to x*3 for each string)
# .replace() : Replace occurrences of pattern/regex with some other string
# .slice() : Slice each string in the Series
# .split() : Split strings on delimiter or regex
# .strip() : Trim whitespace from both sides, including newlines
# .rstrip() : Trim whitespace on right side
# .lstrip() : Trim whitespace on left side

In [92]:

# 7.5 Categorical Data

In [93]:
# a column may contain repeated values
# functions like .unique() and .value_counts() enables us to extract the distict values from an array and compute frequencies
values = pd.Series(['apple','orange','apple',
            'apple']*2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [94]:
pd.unique(values)

array(['apple', 'orange'], dtype=object)

In [95]:
pd.value_counts(values)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_9556\3297668723.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [97]:
# many data systems have specialized approaches for representing data with repeated values
# in data warehousing, best practice is to use dimension tables containing distinct values and storing the primary observations as integer keys
values = pd.Series([0,1,0,0]*2)
dim = pd.Series(['apple','orange'])
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [98]:
dim

0     apple
1    orange
dtype: object

In [99]:
# use .take() to restore the original Series of strings
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [ ]:
# representation of values as integers is called categorical or dictionary-encoded representation
# array of distinct values can be called the 'categories', 'dictionary', or 'levels' of the data
# in this book is called 'categorical' and 'categories' - referencing categories are called 'category codes' or 'codes'
# can also perform transformations on the categories while leaving the codes unmodified
# transformations can be: renaming categories or appending a new category without changing the order or position of the exsiting categories

In [100]:
# Categorical Extension Type in pandas
# categoriacl extension type for holding data that uses the integer-based categorical representation or 'encoding'
# as a data compression technique with many occurrences of similar values, faster performance & lower memory use for string data
fruits = ['apple','orange','apple','apple']*2
N = len(fruits)

In [102]:
rng = np.random.default_rng(seed=12345)

In [103]:
df = pd.DataFrame({'fruit':fruits,
                   'basket_id':np.arange(N),
                   'count':rng.integers(3,15,size=N),
                   'weight':rng.uniform(0,4,size=N)},
                  columns = ['basket_id','fruit','count','weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [ ]:
alphabet = ["a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z"]
alphabet

In [ ]:
decode_this = alphabet[18] + alphabet[7] + alphabet[8] + alphabet[19]
decode_this